
===========================================================================
report_tns
============================================================================
tns -10825.60

===========================================================================
report_wns
============================================================================
wns -5.08

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -5.08

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack 0.18
