
===========================================================================
report_tns
============================================================================
tns -1326.37

===========================================================================
report_wns
============================================================================
wns -6.67

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.67

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.46
