
===========================================================================
report_tns
============================================================================
tns -1259.97

===========================================================================
report_wns
============================================================================
wns -6.44

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.44

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.38
