
===========================================================================
report_tns
============================================================================
tns -1397.40

===========================================================================
report_wns
============================================================================
wns -6.87

===========================================================================
report_worst_slack -max (Setup)
============================================================================
worst slack -6.87

===========================================================================
report_worst_slack -min (Hold)
============================================================================
worst slack -0.51
