###############################################################################
# Created by write_sdc
# Mon Jul 20 09:53:22 2026
###############################################################################
current_design compute_core
###############################################################################
# Timing Constraints
###############################################################################
create_clock -name clk -period 10.0000 [get_ports {clk}]
set_clock_transition 0.1500 [get_clocks {clk}]
set_clock_uncertainty 0.2500 clk
set_propagated_clock [get_clocks {clk}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {compute_en}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {g_in_flat[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {h_in_flat[9]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {load_en}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready_out}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {rst_n}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {w_in}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[0]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[10]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[11]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[12]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[13]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[14]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[15]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[16]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[17]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[18]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[19]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[1]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[20]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[21]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[22]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[23]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[24]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[25]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[26]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[27]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[28]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[29]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[2]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[30]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[31]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[32]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[33]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[34]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[35]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[36]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[37]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[38]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[39]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[3]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[40]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[41]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[42]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[43]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[44]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[45]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[46]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[47]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[48]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[49]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[4]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[50]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[51]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[52]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[53]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[54]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[55]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[56]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[57]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[58]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[59]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[5]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[60]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[61]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[62]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[63]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[6]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[7]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[8]}]
set_input_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {x_in_flat[9]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {ready_in}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {valid_out}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[0]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[10]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[11]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[12]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[13]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[14]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[15]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[16]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[17]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[18]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[19]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[1]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[20]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[21]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[22]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[23]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[24]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[25]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[26]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[27]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[28]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[29]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[2]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[30]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[31]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[32]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[33]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[34]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[35]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[36]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[37]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[38]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[39]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[3]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[40]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[41]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[42]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[43]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[44]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[45]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[46]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[47]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[48]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[49]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[4]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[50]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[51]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[52]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[53]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[54]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[55]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[56]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[57]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[58]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[59]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[5]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[60]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[61]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[62]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[63]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[6]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[7]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[8]}]
set_output_delay 2.0000 -clock [get_clocks {clk}] -add_delay [get_ports {y_out_flat[9]}]
###############################################################################
# Environment
###############################################################################
set_load -pin_load 0.0334 [get_ports {ready_in}]
set_load -pin_load 0.0334 [get_ports {valid_out}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[63]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[62]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[61]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[60]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[59]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[58]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[57]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[56]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[55]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[54]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[53]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[52]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[51]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[50]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[49]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[48]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[47]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[46]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[45]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[44]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[43]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[42]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[41]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[40]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[39]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[38]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[37]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[36]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[35]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[34]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[33]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[32]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[31]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[30]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[29]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[28]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[27]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[26]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[25]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[24]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[23]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[22]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[21]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[20]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[19]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[18]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[17]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[16]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[15]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[14]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[13]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[12]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[11]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[10]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[9]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[8]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[7]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[6]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[5]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[4]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[3]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[2]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[1]}]
set_load -pin_load 0.0334 [get_ports {y_out_flat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {clk}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {compute_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {load_en}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {ready_out}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {rst_n}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {valid_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {w_in}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {g_in_flat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {h_in_flat[0]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[63]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[62]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[61]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[60]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[59]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[58]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[57]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[56]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[55]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[54]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[53]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[52]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[51]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[50]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[49]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[48]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[47]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[46]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[45]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[44]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[43]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[42]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[41]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[40]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[39]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[38]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[37]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[36]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[35]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[34]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[33]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[32]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[31]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[30]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[29]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[28]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[27]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[26]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[25]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[24]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[23]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[22]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[21]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[20]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[19]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[18]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[17]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[16]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[15]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[14]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[13]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[12]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[11]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[10]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[9]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[8]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[7]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[6]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[5]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[4]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[3]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[2]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[1]}]
set_driving_cell -lib_cell sky130_fd_sc_hd__inv_2 -pin {Y} -input_transition_rise 0.0000 -input_transition_fall 0.0000 [get_ports {x_in_flat[0]}]
set_timing_derate -early 0.9500
set_timing_derate -late 1.0500
###############################################################################
# Design Rules
###############################################################################
set_max_transition 0.7500 [current_design]
set_max_fanout 10.0000 [current_design]
